{
  "date": "Wednesday April 23rd, 2014",
  "title": "How Web Design Can Hurt Your Restaurant",
  "thumbnail": "",
  "body": "## A tale about how bad design ruined my lunch.\n\nI would like to tell you a story. It is a gripping tale of whimsy, in which we follow four companions on a culinary adventure. It begins, as most tales do, in the offices of a local ad agency, where we contemplate the very existence of man and why[He](https://web.archive.org/web/20161115084153/http://en.wikipedia.org/wiki/Man_(disambiguation))exists (and how to successfully communicate our clients’ strategic messages in a meaningful way).\n\nOn this particular day we drew the conclusion that we did exist at this particular time (noon-ish), for one reason alone: Chinese food delivery. Off we dashed to wash our faces in the glow of Google searches and Yelp! reviews alike. We searched high and low with few options appeasing our hungering adventurers’ spirit.\n\nSuddenly, and without warning, we heard a shout in the distance.\n\n“[Lovers Egg Roll](https://web.archive.org/web/20161115084153/http://www.loverseggroll.net/)!” echoed through the halls of and off of every wall.\n\n“I just called and we’re in their delivery area!”\n\n“Pull up the menu!”\n\nIn tandem, we greedy adventurers navigated our computing devices to the Lover’s Egg Roll website, which purports to offer an overview of the culinary delights available at this fine establishment.\n\nWe were greeted with this:\n\n![Lovers Eggroll](/images/uploads/lovers-eggroll.png)\n\nAvert thine eyes young designers! Do not be tainted by this foul web design sin!\n\nAs a restaurant owner you should be aware of the fact that your food, the lifeblood of your business, is being judged long before anyone grabs a fork. Design plays an important role in defining the dining experience long before anyone steps foot into your building.\n\nThe photography you choose is only one portion of the story that becomes the experience people will tell their friends about the next time they are looking for a “word of mouth” reference. Should it not also be presented in an inviting and navigable fashion that conveys the intended restaurant concept from the first click?\n\nWhile the website is very rarely used in recalling the restaurant experience, it is important to note that it is always a deciding factor in the initial decision.\n\nIndeed, it’s the first impression hungered hoards of adventurers will have of your tavern, inn, beer garden, or Asian food emporium. If you pass that first test, only then will your ambiance, menu design, curbside appeal, lighting and quality of food come into play.\n\nIf you take the time to put your heart and soul into an egg roll, then at least give it a fighting chance by inviting consumers to enter your establishment rather than scare them off.\n\nAt the very least, make it simply appealing and exceedingly easy to use. A hint to yon food purveyors of every make and order that dwell upon delivery as a means to wealth – always make the phone number easy to find with thine eyes. Include it upon the menu page and everywhere I looketh. Basically, keep it simple so we can see you have good offerings and we don’t have to work hard to figure that part out.\n\nLong story short, we ordered pizza today."
}