{
  "date": "Friday April 10th, 2015",
  "title": "How to style the twitter api.",
  "category": "Blog Entries",
  "body": "## How to insert a custom Twitter feed on your website quickly and easily\n\n<!--StartFragment-->\n\nTwitter has been a huge pain for designers for the past few years. Styling anything in their API is constantly a source of frustration and agony. With the help of Harry Hopkins we have worked up an easy-to-use solution that can work with any embedded widget.\n\nThe first thing you will want to do is to [download the source files here](https://web.archive.org/web/20160323131300/http://clarkbachelot.com/wp-content/uploads/2016/01/twitter_api_fix.zip). Once you have those source files you will want to do a couple of things to make sure it works with your feed.\n\nAfter downloading the source files for the project you will need to go to Twitter and make a Twitter widget. You can do that by following the instructions below.\n\nSelect “Settings” from the drop down menu in the top right corner of your default Twitter page\n\n![twitter-api-fix](/images/uploads/twitter-api-1.png)\n\nSelect “Widgets” in the left column\n\n![twitter-api-fix-2](/images/uploads/twitter-api-2.png)\n\nIf you have not already created your widget then select “Create New.” If you already have a widget made then select “Edit” on the widget you would like to use\n\n![twitter-api-fix-3](/images/uploads/twitter-api-3.png)\n\nInsert the “User Name” of the twitter feed you would like to use\n\n![twitter-api-fix-4](/images/uploads/twitter-api-4.png)\n\nCopy the code provided to you by twitte\n\n![twitter-api-fix-5](/images/uploads/twitter-api-5.png)\n\nYou will only need two bits of data from the previously mentioned code. You will need the “href” and the “data-widget-id.” Once you have those two snippets of code you can insert then into the areas indicated below which can be found in the index.html files provided in the source file .zip.\n\n### START CODE\n\n```\n<a class=\"twitter-timeline\"\nhref=”INSERT YOUR HREF HERE (ex. https://twitter.com/clarkbachelot)”\ndata-widget-id=\"INSERT YOUR ID HERE (ex.380184835865575425)\"\ndata-related=\"twitterapi,twitter\"\ndata-aria-polite=\"assertive\"\ndata-tweet-limit=\"3\"> \nTweets by @YOURTWITTERHANDLEHERE (this is incase the twitter widget does not load)</a>\n```\n\nIt is set up so that it copies the timeline that the Twitter widget creates and adds another one to the page that you can customize via CSS.\n\n\n\nYou can edit the files referenced below to customize your Twitter feed however you see fit. You can[view an example of this in action here](https://web.archive.org/web/20160323131300/http://clarkbachelot.com/twitter_api_fix/index.html). You will notice I took out all of the default Twitter clutter and left just the tweet to be customized.\n\nBy simply editing the provided .css file (twittertimeline.css) you can style your feed using full .css properties. Additionally you can use the javascript file (twitterfeed.js) to customize the animation of your new twitter feed. It is pretty comprehensive and self explanatory.\n\n### ADDITIONAL INFORMATION\n\n**Important Twitter Files**\n\n* /scripts/twitterFeed.js\n\n  * This file copies the Twitter Timeline and then sets it up to cycle.\n  * Look for **$customTimeline.contents().find(‘.h-feed’).cycle({**and you can customize the cycle options.\n\n    * timeout: this allows you to set the timing in seconds between transitions\n    * speed: this allows you to set the transition speed in seconds\n* /css/twittertimeline.css\n\n  * This is where all the custom CSS is located.\n  * I’ve added this file to the index.html file\n  * Look for the following line and uncomment the display:none to hide the original timeline\n\n    * /\\* Hide the actual widget \\*/\\\n      .twitter-timeline-rendered {\\\n      /\\* display: none!important; \\*/\\\n      width:90% !important;\\\n      }\n    * We left this in so that you can see the original to make style tweaks",
  "thumbnail": "/images/uploads/twitter-featureart.jpg"
}