{
  "date": "Monday March 16th, 2020",
  "title": "Do Looks Really Matter?",
  "category": "Blog Entries",
  "body": "## How good design is more than just a pretty face.\n\nAs designers we grow accustomed to the trends in the web design world and try to utilize them to the best of our abilities while also trying to initiate our own trends in the process.\n\nSometimes a trend is truly progressive and takes the field as a whole in a new direction – like flat design. Other times trends were bad to begin with and somehow gained popularity anyway.\n\nHere at [bloomfield knoble](www.bloomfieldknoble.com/) we strive to pursue the best design possible for any given project. That often means guiding the client away from what they have previously seen and taken a liking to. Below you will find the top 5 trends that we find the most repulsive.\n\n**1. Popup Windows**\n\nWhile traditional popup windows are mostly now reserved for spam websites, they have actually started morphing into automatic window overlays that take the form of ads, newsletter signups or God forbid, surveys.\n\nIt doesn’t really need to be said here but I will anyway; ads are good for the site’s revenue but terrible for the user experience. In the end we need to find a better solution to generating ad revenue without turning the end user away from the site’s content.\n\n![Popup Killer](/images/uploads/popup-killer-bypass-website-barriers-without-signing-up-completing-surveys.w654-600x400.jpg)\n\n**2. Flash**\n\nWith the ubiquity of mobile devices and mobile browsing, there’s no excuse for a site in 2014 that still uses Flash.\n\nYes, animation is cool on a website but only when used in a subtle and effective way. Plus there are so many other ,[better ways](https://www.w3schools.com/html/html5_intro.asp) to accomplish that now. Also, do not forget those all-important mobile users that you may be leaving out.\n\n**3. Skeuomorphism**\n\n[Skeuomorphic design](https://en.wikipedia.org/wiki/Skeuomorph) is essentially designing something to resemble, as closely as possible, a real tangible item. For example putting a leather texture on a web calendar so it resembles the calendar one might find on a desk.\n\nWhile skeuomorphic design had a time and a place while trying to bridge the gap between technology and “real world” items, it is not needed anymore and users will much prefer a more simple design that focuses on functionality instead of overly designed flourishes.\n\n![FMF Small](/images/uploads/fmfsmall-600x400.jpg)\n\n**4. Images Used for Text**\n\nThere is no reason a site designed for modern browsers should need to use an image for text. Google Fonts API is compatible with[ every browser since IE6](https://developers.google.com/fonts/faq) (and shame on you if you inherently support that browser anyway).\n\n**5. Bad Stock Photos**\n\nThis is a tricky one because clients often cannot afford an on-set shoot for every ad they produce. Plus, stock photos that don’t come across as looking like stock photos can either be expensive or hard to make/produce yourself.\n\nAt the end of the day though, a good rule of thumb is that having no photo at all is still better than a horrible stock photo, so weigh your options carefully.\n\n**The solution…**\n\nA lot of these issues can be taken care of before they ever start. Good design is about taking risks, exploring new ideas, and creating something that works well in the end. There is no need to use technology just for the sake of using it. Too many HTML5 websites appear to be a sample of how talented the designer is. That is never the goal with a client’s website. Design is important, but so are business goals. In the end if your design does not accomplish the goal that was set forth in the brief then you have failed as a designer.\n\nDesigners need to check their ego at the door and remember that good design, when done right, will be an easy-to-use tool that not only looks good but also can perform, convert, and fulfill its purpose.",
  "thumbnail": "/images/uploads/fmfsmall-600x400.jpg"
}