{
  "date": "Tuesday March 4th, 2014",
  "title": "One Helvetica Life",
  "category": "Blog Entries",
  "thumbnail": "/images/uploads/helvetica-1.png",
  "body": "## Mike Parker changed the world with one Sans Serif Font\n\nOne of my greatest inspirations, [Mike Parker](https://en.wikipedia.org/wiki/Mike_Parker_(typographer)), died last Sunday, February 23rd at the ripe old age of 85. He has been described as “the font god” which, to be fair, is probably an accurate description for the man who helped bring Helvetica to the world. However, he is also credited with the development of more than 1,100 typefaces while at the Mergenthaler Linotype Company.\n\nWhat is it about the Swiss and their sans serif typefaces? Helvetica emerged from Switzerland in 1957 and went out to shape the modern world. The Helvetica typeface would sort out not just transport systems, but whole cities. The font appeared as Europe emerged from the shadow of World War II and was already making strong contributions to midcentury modernism. Helvetica was perfectly suited to this period, and its use reflected another pervasive force of the age–the coming of mass travel and modern consumerism.\n\nHelvetica is a font of such practicality and beauty that it is both ubiquitous and something of a cult. The typeface even inspired a compelling and successful movie (Gary Hustwit’s *Helvetica*), whose premise is that on the streets of the world, the font is like oxygen; you have little choice but to breathe it in.\n\nTo entrench something so deeply into a society takes a level of understanding and passion that is hard to describe. So I will not begin to try. I will simply let Mike Parker do it himself.\n\n*“When you talk about the design of Haas Neue Grotesk or Helvetic, what it’s all about is the interrelationship of the negative shape, the figure-ground relationship, the shapes between characters and within characters, with the black, if you like, with the inked surface. And the Swiss pay more attention to the background, so that the counters and the space between characters just hold the letters. I mean, you can’t imagine anything moving; it is so firm. It is not a letter that bent to shape; it’s a letter that lives in a powerful matrix of surrounding space. It’s… oh, it’s brilliant when it’s done well.”*–*[Helvetica](http://www.imdb.com/title/tt0847817/?ref_=ttqt_qt_tt)* (2007), directed by Gary Hustwit\n\nEvery person is affected by Helvetica in some way. Whether you’re [taking the bus](http://stbride.org/friends/conference/hiddentypography/parisine.html), [shopping for clothes](http://jpda.net/projects/american-apparel-williamsburg), [enjoying a meal](http://designspiration.net/image/3482243894433/), or even decorating the offices here at [bloomfield knoble](http://www.bloomfieldknoble.com/) *(see below)*, Helvetica is part of your life [in some way](http://alechagraphicdesigntalk.files.wordpress.com/2012/10/chaverricxamplesof-helvetica.jpg).\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">No better way to spend a Saturday than hanging out with friends @Andy\\\\_Edwards\\\\_ and <a href=\"https://twitter.com/clarkbachelot?ref_src=twsrc%5Etfw\">@clarkbachelot</a> <a href=\"https://twitter.com/bloom_tweets?ref_src=twsrc%5Etfw\">@bloom_tweets</a> <a href=\"http://t.co/wYWnHH0TfE\">pic.twitter.com/wYWnHH0TfE</a></p>&mdash; Thomas J Thompson (@t_j_thompson) <a href=\"https://twitter.com/t_j_thompson/status/338383426006687745?ref_src=twsrc%5Etfw\">May 25, 2013</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\nThank you Mike Parker for making the world easier to read."
}