{
  "date": "Tuesday March 17th, 2020",
  "title": "Eyemart Express E-Commerce",
  "thumbnail": "/images/uploads/eyemart-header.jpg",
  "category": "User Experience",
  "body": "With growing competition for Online Optical Retail, Eyemart needed to find a point of differentiation in the market. Given only six months we had to handle everything from wire framing to testing, new photography styles to in-store experience implementation, and more.\n\n## ABOUT THE PROJECT\n\nEyemart Express is one of the largest optical retailers in the nation. With nearly 200 stores nationwide and over 25 years of growth, it was time to enter a new arena.\n\nEyeMart tried to implement e-commerce three times before, but were unsuccessful. Given my skill set, I was brought in to implement e-commerce in a new way.\n\nThe first thing we did was identify the largest point of frustration in purchasing glasses online. We found that the prescription form for all optical retailers had the highest abandonment rate. We would focus our e-commerce experience as a CRM effort. Once we have the users prescription saved after a retail purchase, we can link their account and make purchasing glasses easier than ever.\n\n### WIREFRAME\n\n![Header Wireframe](/images/uploads/eyemart-wireframe.png \"Eyemart Desktop Navigation Wireframe\")\n\nThis is one of several prototypes we made with Framer.\n\n![working header](/images/uploads/header-sample.gif)\n\n[See the prototype here.](https://framer.cloud/eePnI/)\n\nWe also needed to update the public side of the site along with the new user focused e-commerce side of the experience. Below you will find the comparison between the old site, new site, and e-commerce user site.\n\nWe then wrote a formula to recommend specific glasses to each user. The formula considers the users size, prescription, and even style preferences to recommend frames specific to that user\n\n![Evolution of Eyemart Express](/images/uploads/eyemart-evolution.jpg)\n\n### Desktop & Mobile\n\nWith the always present mobile user, the site was obviously made mobile responsive\n\n![Eyemart Express Mobile Presentation](/images/uploads/eme-desktop-mobile.jpg)\n\n### THE RESULTS\n\nWith the lofty goal of having the easiest way to purchase eyewear online we had a huge hurdle in front of us. We were able to have very impressive numbers despite the numerous hurdles.\n\nNPS: 72\\\nCES: **4.7**\\\nCart Abandonment Rate: **34%**\\\nPage Views: **Up 2.91%**\\\nUnique Page Views: **Up 2.50%**\\\nAverage Time on Page: **Up 12.08%**\\\nBounce Rate: **Down 29.56%**\\\nExit Percentage: **Down 2.04**\n\n![stats for eyemart express](/images/uploads/eye-stats.png)"
}